import numpy as np
# Завдання 1
# Створіть масив:
# 1 2 3 4
# 5 6 7 8
# 9 10 11 12
# 13 14 15 16


#
# nums = np.array(
#     [
#     [1,2,3,4],
#     [5,6,7,8],
#     [9,10,11,12],
#     [13,14,15,16]
#     ]
# )
# Використовуючи індекси виведіть:
# ● число 14
# print(nums[3,1])

# Використовуючи індекси виведіть:
# ● перший стовпчик
# print(nums[:,0])

# Використовуючи індекси виведіть:
# ● верхню половину
# print(nums[0:2,:])

# Використовуючи індекси виведіть:
# ● замініть числа в рядках 2-3 на 100
# nums[1:3] = 100
# print(nums)

# Використовуючи індекси виведіть:
# ● зробіть другий рядок таким як останній рядок
# nums[1,:] = nums[3,:]
# print(nums)

# Завдання 2
# У масиві з попереднього завдання створіть маску для
# парних чисел. З її допомогою
# ● виведіть самі числа


# mask = (nums % 2).astype(bool)
# result = nums[mask]
# print(mask)


# mask = nums % 2
# result = nums[mask] чому воно бере як індекси [4,4,4] звідки 4 ?
# print(mask)


# ● замініть їх на 100
# mask = (nums % 2).astype(bool)
# nums[mask] = 100
# print(nums)
# print(mask)



# Завдання 3
# Створіть 2 масиви типу uint8:
# Масив 1: 128 200 10
# Масив 2: 250 10 34
# Об’єднайте їх у пропорції 20% першого масив + 80%
# другого масиву. В результаті має бути тип даних uint8 та
# числа в діапазоні 0-255

nums1 = np.array([128, 200, 10]).astype(np.uint8)
nums2 = np.array([250, 10, 34]).astype(np.uint8)

nums1 = nums1.astype(np.float16)
nums2 = nums2.astype(np.float16)

nums_80 = nums2 * 0.8
nums_20 = nums1 * 0.2

result = nums_80 + nums_20

mask = result > 255
result[mask] = 255

result = result.astype(np.uint8)

print(result)
