import dotenv
import os
from parser import chain
from langchain_google_genai import ChatGoogleGenerativeAI
from langchain_core.messages import (
    HumanMessage,
    AIMessage,
    SystemMessage,
    trim_messages,
)

dotenv.load_dotenv()

api_key = os.getenv("GEMINI_API_KEY")


# # модель
llm = ChatGoogleGenerativeAI(
    model="gemini-3.5-flash-lite",   # назва моделі
    api_key=api_key    # ключ до сервера з моделлю
)



# Завдання 1
# Напишіть чат бота, який спілкується у стилі різних
# персонажів книг\фільмів або відомих людей. Ким саме бути
# чат бот вирішує з повідомлення від користувача.
# Якщо персонаж або книга невідомі, то відповісти що
# невідома інформація та запропонувати декілька відомих
# прикладів на вибір

# messages = [
#
#     SystemMessage("""
#     Ти -- ввічливий чатбот
#     Твоя задача підтримувати спілкування з користувачем у  стилі різних
#     персонажів книг\фільмів або відомих людей. Ким саме бути
#     вирішуй з повідомлення від користувача.
#
#     ###ІНСТРУКЦІЇ###
#     1. Відповіді мають дути короткими(до 2 речень)
#     2.Якщо персонаж або книга невідомі, то відповісти що
#     невідома інформація та запропонувати декілька відомих
#     прикладів на вибір
#     """)]
#
#
# while True:
#     user_text = input("Ви: ")
#
#     if user_text == "":
#         break
#
#     human_message = HumanMessage(content=user_text)
#
#     messages.append(human_message)
#
#     response = llm.invoke(messages)
#
#     print(f"AI: {response.text}")
#
#     messages.append(response)







# авдання 2
# Напишіть чат бота, який дає відповіді на питання
# стосовно умов повернення товару.
# Якщо користувач запитує щось інше, то відповідати що
# немає інформації.
# Застосуйте обмеження історії(можна десь 5 повідомлень)

# with open("data/lesson9/return_policy.txt", "r",encoding="utf-8") as f:
#     rules = f.read()
#
#
#
#
# messages = [
#     SystemMessage(
#     f"""
#     Ти - консультант магазину.
#     Твоя задача давати відповіді на питання стосовно умов повернення товару.
#
#
#     ###ІНСТРУКЦІЇ###
#     1. Відповіді мають дути короткими(до 2 речень)
#     2.Якщо користувач запитує щось інше, то відповідати що немає інформації.
#     3.Нічого не вигадуй, відповідай за правилами повернення, якщо в правилах не вистачає інформації пиши, що ти не знаєш.
#
#     ###ПРАВИЛА ПОВЕРНЕННЯ###
#     {rules}
#     """
#     )
# ]
#
#
# trimmer = trim_messages(
#     strategy='last',  # залишати останні повідомлення
#
#     token_counter=len,  # рахуємо кількість повідомлень
#     max_tokens=5,  # залишати максимум 5 повідомлення(System, AI, Human)
#
#     start_on='human',  # історія завжди починатиметься з HumanMessage
#     end_on='human',  # історія завжди закінчуватиметься з HumanMessage
#     include_system=True  # SystemMessage не чіпати
# )
#
#
# while True:
#     user_text = input("Ви")
#
#     if user_text == "":
#         break
#
#     human_message = HumanMessage(content=user_text)
#
#
#     messages.append(human_message)
#
#     messages = trimmer.invoke(messages)
#
#     response = llm.invoke(messages)
#
#     print(f"AI: {response.text}")
#
#     messages.append(response)
#



# Завдання 3
# Напишіть чат бота, який допомагає у вивченні
# англійської мови з наступним функціоналом:
#  якщо користувач просить перекласти слово або фразу
# то дається переклад слова та приклад використання в
# реченні
#  якщо користувач просить перекласти речення, то
# Практичне завдання
# дається переклад самого речення, а також пояснення
# граматики, наприклад структура there is\are, питання в
# різних часових формах, тощо.
# Приклади реалізуйте як HumanMessage та AIMessage


messages = [
    SystemMessage(
    r"""
    Ти - досвічений вчитель англійської  мови.
    Твоя допомагати вивчити англійську мову.


    ###ІНСТРУКЦІЇ###
    1. якщо користувач просить перекласти слово або фраз то дається переклад слова та приклад використання в реченні
    2.якщо користувач просить перекласти речення, то дається переклад самого речення,
    а також пояснення граматики, наприклад структура there is\are, питання в різних часових формах, тощо.
    """
    ),
    HumanMessage(
    "Переклади слово awesome"
    ),
    AIMessage(
    "Переклад: дивовижний, неймовірний  Ось приклад в реченніYou look awesome! --- Ти виглядаєш чудово!"
    )
]


while True:
    user_text = input("Ви")

    if user_text == "":
        break

    human_message = HumanMessage(content=user_text)


    messages.append(human_message)




    response = llm.invoke(messages)

    data = {
        "text": response.text
    }

    eng_words = chain.invoke(data)

    print(f"AI: {response.text}")
    print(eng_words)

    messages.append(response)



# Завдання 4
# Модифікуйте попереднє завдання таким чином, щоб в
# SystemMessage передавався список вивчених слів
# користувачем.
# Для цього напишіть окрему модель яка буде діставати з
# відповіді(AIMessage) усі англійські слова(вважаємо що
# користувач знає лише ті слова, про які йому сказала модель).
# Список вивчених слів треба зберігати в json файлі та
# відвантажувати при запуску програми.
# Змініть функціонал таким чином:
#  якщо користувач просить перекласти слово або фразу
# то дається переклад слова та приклад використання в
# реченні з вивченими словами
#  якщо користувач просить перекласти речення, то
# додатково пояснюється значення невідомих слів

