import dotenv
import os
from langchain_google_genai import GoogleGenerativeAI
from langchain_core.prompts import PromptTemplate


dotenv.load_dotenv()

api_key = os.getenv("GEMINI_API_KEY")


llm = GoogleGenerativeAI(
    model="gemini-3.1-flash-lite",
    api_key=api_key,
    temperature=0.1,
)

# авдання 1
# Напишіть промпт для генерації коду функції для
# вирішення певної задачі.
# Вхідні параметри – мова програмування, опис задачі
# Реалізуйте двома способами:
#  Zero-shot
#  Few-shot


# prompt = PromptTemplate.from_template(
#     """
#     Ти — досвідчений програміст.
#     Задача: згенеруй код  для певної задачі
#
#     ###ПРАВИЛА###
#     1.Пиши тільки код
#     2.Не додавай зайвого коду, наприклад main, якщо він не потрібен
#
#
#     ###Приклад###
#     1.Вхідні дані:
#     Мова програмування: {language}
#     Опис задачі: Створити функцію, яка приймає список чисел і повертає найбільше число.
#     Результат:
#     def find_max(numbers):
#     return max(numbers)
#
#     Мова програмування: {language}
#     Опис задачі: Створити функцію, яка перевіряє, чи є число парним.
#     Результат:
#     def is_even(number):
#     return number % 2 == 0
#
#
#     ###Вхідні параметри###
#     Мова програмування: {language}
#     Опис задачі:{task}
#     """
# )
#
# language = "Python"
# task = "simple calculation, +/-"
#
#
# data = {
#     "language": language,
#     "task": task,
# }
#
#
# text = prompt.invoke(data)
#
# response = llm.invoke(text)
# print(response)


# Завдання 2
# Напишіть промпт для переведення тексту з
# неформального стилю в формальний
# Вхідні параметри – текст
# Реалізуйте двома способами:
#  Zero-shot
#  Few-shot

# prompt = PromptTemplate.from_template(
#     """
#     Ти -- професійний редактор текстів.
#     Перетвори наведений текст із неформального стилю на формальний.
#
#     ###ВИМОГИ###
#     1.Збережи основний зміст орігінального тексту.
#     2.Відповідь повина бути не більше 4 речень.
#     3.Виправ орфографічні помилки та пунтакційні помилки.
#
#     ###ПРИКЛАДИ###
#
#     Текст: Привіт! Короче, ми тут подумали і вирішили зробити знижки на всі товари. Заходьте на сайт, купуйте поки є.
#     Результат: Повідомляємо про початок акційного періоду та надання знижок на весь асортимент товарів. Запрошуємо ознайомитися з оновленими пропозиціями на нашому офіційному вебсайті. Звертаємо увагу, що кількість товару за спеціальною ціною обмежена.
#
#     ---
#
#     Текст: Сорян, що пізно пишу, але завтра на зустріч прийти не зможу, бо захворів. Давайте перенесемо на наступний тиждень.
#     Результат: Перепрошую за пізнє сповіщення, однак змушений повідомити про неможливість моєї участі в завтрашній зустрічі через стан здоров'я. Пропоную перенести заплановане обговорення на наступний тиждень. Буду вдячний за узгодження зручної для вас дати та часу.
#
#     ---
#
#     Текст: Наша команда круто розбирається в IT і може швидко забацати вам класний сайт під ключ. Пишіть у дірект, якщо цікаво.
#     Результат: Наша компанія надає професійні послуги у сфері інформаційних технологій, зокрема розробку вебсайтів «під ключ». Ми гарантуємо якісне та оперативне виконання завдань будь-якої складності. Для отримання детальної консультації звертайтеся за вказаними контактами.
#
#
#     ###ВХІДНИЙ ПАРАМЕТР###
#     Текст:{text}
#     Результат:
#     """
# )
#
# input_text = "Так, кидай код і поясни, що хочеш у ньому змінити — розберемося"
#
#
# data = {
#     "text": input_text,
# }
#
# text = prompt.invoke(data)
#
# response = llm.invoke(text)
# print(response)


# Завдання 3
# Прочитайте файл data\lesson10\products.txt з описом
# Практичне завдання
# послуг СПА. Напишіть промпт для рекомендації послуги
# виходячи з запиту користувача
# Вхідні параметри – опис товарів, запит користувача
# Реалізуйте двома способами:
#  Zero-shot
#  Chain of Thoughts

#
# with open("data/lesson10/products.txt", "r",encoding="UTF-8") as f:
#     products = f.read()
#
# prompt = PromptTemplate.from_template(
#     """
#     Ти менеджер СПА.
#     Твоє завдання — проаналізувати запит користувача та на основі опису доступних SPA-послуг вибрати найбільш підходящу послугу.
#
#     ###ХІД ДУМОК###
#     Визнач основну потребу користувача із його запиту.
#     Виділи ключові критерії вибору послуги.
#     Проаналізуй усі доступні SPA-послуги та порівняй їх із потребами користувача.
#     Визнач, яка послуга найкраще відповідає зазначеним критеріям.
#
#     ###ВХІДНІ ДАНІ###
#     Опис доступних SPA-послуг:{products}
#     Запит користувача:{user_query}
#
#     """
# )
#
#
# data = {
#     "products": products,
#     "user_query" : "Який масаж порадиш для масажу спини "
# }
# text = prompt.invoke(data)
#
# response = llm.invoke(text)
# print(response)
